# Pandas Library function

### Data input and output

In [1]:
import numpy as np
import pandas as pd

### CSV input

In [2]:
df = pd.read_csv('example.txt')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [3]:
import numpy
import pandas

In [4]:
df = pandas.read_csv('example.txt')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
import numpy as np
import pandas as pd

In [8]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## DataFrames 

#### Creates rows and columns

In [9]:
import numpy as np
import pandas as pd

In [43]:
from numpy.random import randn
np.random.seed(101)

In [46]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [13]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

## Selection and indexing

In [14]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [15]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

### Creating a new column

In [32]:
df['New'] = df['W'] + df['Y']

In [33]:
df

          W         X         Y         Z       New
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

### Removing columns

In [34]:
df.drop('New',axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

### Search using loction

In [23]:
df.loc['B','Y']

0.16690463609281317

In [24]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

### Search using condition

In [25]:
df>0

       W      X      Y      Z    New
A   True   True  False  False  False
B  False   True   True   True   True
C   True   True   True   True   True
D  False  False  False   True  False
E  False   True   True   True   True

In [35]:
df[df<0]

          W        X         Y         Z      New
A       NaN      NaN -1.706086 -1.159119 -1.40342
B -0.134841      NaN       NaN       NaN      NaN
C       NaN      NaN       NaN       NaN      NaN
D -0.497104 -0.75407 -0.943406       NaN -1.44051
E -0.116773      NaN       NaN       NaN      NaN

### Delete the column permanently 
#### By storing it in another variable

In [36]:
df = df.drop('New',axis=1)

In [37]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [38]:
df[df<0]

          W        X         Y         Z
A       NaN      NaN -1.706086 -1.159119
B -0.134841      NaN       NaN       NaN
C       NaN      NaN       NaN       NaN
D -0.497104 -0.75407 -0.943406       NaN
E -0.116773      NaN       NaN       NaN

### Creating labels and series

In [40]:
import numpy as np
import pandas as pd

In [51]:
# Using a series you can converta list, numpy,array or dictionary
labels = ['A','B','C']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'A':10,'B':20,'C':30}

### Using lists

In [52]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [53]:
pd.Series(data=my_list,index=labels)

A    10
B    20
C    30
dtype: int64